XYZ.normalized
returns a parallel unit vector or zero vector

XYZ.unit
make this a unit vector or return ERR_NULL_VECTOR

XYZ.#ctor(System.Double,System.Double,System.Double)
construct XYZ from components

XYZ.#ctor(System.Double!System.Runtime.CompilerServices.IsConst*)
construct XYZ from Vec3d

XYZ.basisZ
returns a unit vector in the Z-direction (0, 0, 1)

XYZ.basisY
returns a unit vector in the Y-direction (0, 1, 0)

XYZ.basisX
returns a unit vector in the X-direction (1, 0, 0)

XYZ.zero
returns (0, 0, 0)

XYZ.#ctor
literal constructors. expect heavy optimization.

XYZ
A self-initializing 3d point/vector class.
Notes:
This is intended to be a drop-in replacement for Vec3d.  This means transparent operations with
Vec3d, AKA double*, methods.  This means the compiler may not catch some type errors.
XYZ can be returned by value because the worst that can happen is gratuitous copying of 24
bytes, and we can live with it. In general, we let the compiler figure out the temporary
storage and optimize inline functions.